# Ultralytics YOLO 🚀, AGPL-3.0 license
# DFD-Net: Direction-Aware and Frequency-Aligned Network for Tooth Crack Detection
# Base: YOLO11n (Scales: 0.50, 0.25, 1024)

# Parameters
nc: 1 # number of classes (Tooth Crack)
scales:
  n: [0.50, 0.25, 1024] 

# DFD-Net Backbone (Direction-Aware)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_DEGConv, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_DEGConv, [512, False, 0.25]] # 4-Backbone P3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_DEGConv, [512, True]] # 6-Backbone P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_DEGConv, [1024, True]] # 8-Backbone P5
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA_DSAM, [1024]] # 10 (Global Refinement at Backbone End)

# DFD-Net Neck (Frequency-Aligned & Local Refinement)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, FAAFusion, [512]] # 12 (Aligns P4 feature from layer 6)
  - [-1, 2, C3k2, [512, False]] # 13
  - [-1, 1, DSAM, [512]] # 14 (Local Refinement for P4-Neck)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, FAAFusion, [256]] # 16 (Aligns P3 feature from layer 4)
  - [-1, 2, C3k2, [256, False]] # 17
  - [-1, 1, DSAM, [256]] # 18 (Local Refinement for P3-Neck / Small Head)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 14], 1, FAAFusion, [512]] # 20 (Aligns P4 from layer 14 DSAM output)
  - [-1, 2, C3k2, [512, False]] # 21
  - [-1, 1, DSAM, [512]] # 22 (Local Refinement for P4-Neck / Medium Head)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 10], 1, FAAFusion, [1024]] # 24 (Aligns P5 from layer 10 C2PSA_DSAM output)
  - [-1, 2, C3k2, [1024, True]] # 25
  - [-1, 1, DSAM, [1024]] # 26 (Local Refinement for P5-Neck / Large Head)

  - [[18, 22, 26], 1, Detect, [nc]] # 27 (Detect Heads: P3, P4, P5)